[
  {
    "id": "allerton",
    "image": "2018/pop-up-allerton.jpg",
    "offerDetails": "The Living Treasure of the Garden Islands, the National Tropical Botanical Gardens offers unique experiences for the whole family.  We offer guided tours through Allerton Garden or self led tours through the McBryde Garden. Secluded between rugged cliffs dropping down to a verdant valley floor, prepare to be inspired, amazed and relaxed by nature, history, and culture. <br /><br /><strong>Call 808-742-2623 or visit NTBG.org. Present your local ID at check-in to save 10%  off!</strong>"
  },
  {
    "id": "aston-islander",
    "image": "2018/pop-up-aston-islander.jpg",
    "offerDetails": "Your home away from home. Aston at Poipu Kai is perfect for your Staycation. Accommodations range from one to three bedroom suites, as well as two, three and four bedroom private homes.  Kama&#8216;&#257;ina receive free parking. Fully equipped kitchen, washer and dryer, beach towels are provided for you! No need bring 'em. Book direct and save. <br /><br /><strong>Call 855-747-0759  and book today. * </strong><br /><br />Must present valid State of Hawaii ID upon check-in. Other restrictions may apply."
  },
  {
    "id": "aston-poipu",
    "image": "2018/pop-up-aston-poipu.jpg",
    "offerDetails": "Your Staycation - Just steps from the beach!  The perfect hotel for those who want to get away from it all.  Kama&#8216;&#257;ina enjoy a late check-out when available and amenity fee waived.<br/><br/><strong>* Book Direct and save: Call (808) 822-7417  or visit <a href='http://www.astonislander.com'>www.astonislander.com</a> and Book Today. </strong><br/><br/>* Qualified individual must be occupying the room. Must present valid picture ID."
  },
  {
    "id": "blue-hawaiian-heli",
    "image": "2018/pop-up-blue-hawaiian-heli.jpg",
    "offerDetails": "Blue Hawaiian Helicopters offers 25% off helicopter tours for kama'&#257;ina - subject to availability. Valid State of Hawaii ID required at check in. <br /><br /><strong>View tour details at <a href='http://www.bluehawaiian.com/kauai/tours/'>http://www.bluehawaiian.com/kauai/tours/</a> and call 808-245-5800 for reservations.</strong>"
  },
  {
    "id": "captain-andys",
    "image": "2018/pop-up-captain-andys.jpg",
    "offerDetails": "Since 1980 we've taken guests on Kaua&#8216;i boat tours down the famous N&#257;pali Coast. Whether you choose our 65' Star Yachts, Classic Sailing Catamarans, or Wet & Wild Raft Expeditions, nobody has more fun!<br /><br /><strong> Call 808-335-6833 to redeem your offer or visit us online at <a href='http://www.napali.com.'>www.napali.com</a>.</strong>"
  },
  {
    "id": "hilton-garden-inn",
    "image": "2018/pop-up-hilton-garden-inn.jpg",
    "offerDetails": "Our hotel features a spectacular beachfront location on scenic Wailua Bay, where the famous Wailua River meets the Pacific. Rates are subject to availability. Call (808) 823-6000 to book."
  },
  {
    "id": "holoholo",
    "image": "2018/pop-up-holoholo.jpg",
    "offerDetails": "Experience genuine aloha hospitality service aboard Holo Holo Charter's Aloha Sunset Sail. Cruise along the sunny South Shore while enjoying an island-style buffet dinner, Koloa Rum Mai Tai’s, and listening to the classic homegrown sounds of Hawai&#8216;i’s local artists from the 1970's. Enjoy this all-inclusive tour for just $70 per person. <br/><br/><strong>Check out <a href='http://holoholocharters.com/'>holoholocharters.com</a> or call 808-335-0815 to take advantage of other Kama&#8216;&#257;ina rates: 20% off available on N&#257;pali Coast + Ni&#8216;ihau tours.</strong>"
  },
  {
    "id": "hilo-hattie",
    "image": "2018/pop-up-hilo-hattie.jpg",
    "offerDetails": "Hilo Hattie invites you to visit our Līhu‘e Town store at 3-3252 Kūhiō Hwy. to enjoy our kama'āina and Military discounts! 25% off regularly priced Hilo Hattie labeled garments, 15% off all other regularly priced Fashions and Souvenir Items, 10% off all regularly priced Hilo Hattie Brand Food Items. Military ID is required for all Military discounts. Resident ID is required for all kama'āina discounts. <br/><br/><strong>For further information, please call (808) 245-3404.</strong>"
  },
  {
    "id": "kalaheo-inn",
    "image": "2018/pop-up-kalaheo-inn.jpg",
    "offerDetails": "Kalaheo Inn offers our kama&#8216;&#257;ina guests a 10% discount off our listed rates all year round.  We also offer local companies a 14% discount off our listed rates all year round.  A Hawaii State ID and local address is required for kama'&#257;ina eligibility. For the Corporate rate, local business information is required upon booking a reservation. <br/><br/><strong>For more information please call 808-332-6023 or <a href='mailto:email ki@hawaiiantel.biz'>email ki@hawaiiantel.biz</a>.  <br/><br/> And for listed rates, please visit <a href='http://www.kalaheoinn.com'>www.kalaheoinn.com</a>.</strong>"
  },
  {
    "id": "kauai-beach-resort",
    "image": "2018/pop-up-kauai-beach-resort.jpg",
    "offerDetails": "Kaua&#8216;i Beach Resort invites our Kama&#8216;&#257;ina Guest to enjoy our resort for a fun staycation. Use our free airport shuttle for easy arrival/departure, and book a car on-site with Enterprise Car Rental, if you feel like exploring the beautiful island of Kaua&#8216;i from our central location. We have 3 restaurants, shave ice poolside, a 75 foot water slide, live music nightly, and so much more! This offer is subject to availability. <br /><br /><strong>Please call (888) 805-3843 to book.</strong>"
  },
  {
    "id": "kauai-hiking-tours",
    "image": "2018/pop-up-kauai-hiking-tours.jpg",
    "offerDetails": "Kaua&#8216;i Hiking Tours invites a limited number of kama&#8216;&#257;ina to save 40% on all of our hiking tours (40% off offered to first 20 local inquires with valid Hawai&#8216;i State ID or Driver's License). You never know what you might discover on our island full of hidden beauty spots - plus it's always safer and more fun to hike with others! <br /><br /><strong>Please call for details and availability: 808-212-9928</strong>"
  },
  {
    "id": "kauai-vacation-home",
    "image": "2018/pop-up-kauai-vacation-home.jpg",
    "offerDetails": "Offer valid through 2018. Present a copy of your Hawaii ID and get 10% off quoted rates. Explore Kaua&#8216;i's North Shore from our private 3 bedroom, 2 bath home in Princeville. Hike down to Sea Lodge Beach, take a short drive to Hanalei Bay Beach and &#8216;Anini Beach. Sleeps 6 comfortably. <br/><br/><strong>Call 716-923-3996 to make reservations or go to <a href='http://www.hawaiivacationrent.com/'>http://www.hawaiivacationrent.com/</a>.</strong>"
  },
  {
    "id": "kauai-marriot-resort",
    "image": "2018/pop-up-kauai-marriot-resort.jpg",
    "offerDetails": "Great Kam rates starting at $169 are based on availability.   Come and enjoy a 'Staycation' at the beautiful Kaua'i Marriott Resort.   Great resort amenities includes our renowned one acre swimming pool, 5 spas, kids pool sitting on Kalapakī Beach.  Enjoy dinner at Kukui's and then sit around one of our four fire pits. <br /><br /><strong>Please contact our reservations department for availability at 800-220-2925.  Mahalo!</strong>"
  },
  {
    "id": "kauai-shores",
    "image": "2018/pop-up-kauai-shores.jpg",
    "offerDetails": "A Local Favorite! Save 12% off our best available rate with your local ID. Valid Hawaii State ID or Driver's License required upon check in.<br/><br/><strong> Book your stay now at <a href='http://www.kauaishoreshotel.com'>www.kauaishoreshotel.com.</a></strong><br/><br/> Not combinable with other offers."
  },
  {
    "id": "kayak-kauai",
    "image": "2018/pop-up-kayak-kauai.jpg",
    "offerDetails": "Come paddle, hike and/or snorkel with us on two classic tours! When booked online: 10% off our panoramic Hanalei Snorkel Blue Lagoon river & bay paddle tour and/or paddle and hike to a remote bridal-veil falls on the tranquil & tropical Wailua River on our Sacred Falls tour. <br /><br />Use code: kamaaina10 <br /><br /> <strong><a href='http://www.kayakkauai.com'>www.kayakkauai.com</a> | 888-596-3853  | <a href='mailto:info@kayakkauai.com'>info@kayakkauai.com</a> </strong><br/><br/>Also offer hiking tours, SUP rentals, & outfit N&#257;pali backpackers from our Wailua River Marina location (valid  5/1-12/31/18)."
  },
  {
    "id": "kekaha",
    "image": "2018/pop-up-kekaha.jpg",
    "offerDetails": "Kama&#8216;&#257;ina 10% off.  Mention kama&#8216;&#257;ina rate when inquiring. Call 800-351-4609 to book."
  },
  {
    "id": "koakea",
    "image": "2018/pop-up-koakea.jpg",
    "offerDetails": "Located in sunny Po&#8216;ipū on the south shore, this intimate and romantic resort voted #1 in Kaua&#8216;i by Travel + Leisure offers the island’s closest hotel accommodations to the sand. Whether it’s at the serene pool, in the seaside spa cabana, or at the acclaimed Red Salt restaurant, you can count on award-winning service. <br/><br/><strong> To save up to 35% on room rates, use the link <a href='https://gc.synxis.com/rez.aspx?Hotel=67831&Chain=15889&promo=DISKAMA'>https://gc.synxis.com/rez.aspx?Hotel=67831&Chain=15889&promo=DISKAMA</a> or call (808) 742-4271.<strong>"
  },
  {
    "id": "koloa-landing",
    "image": "2018/pop-up-koloa-landing.jpg",
    "offerDetails": "Enjoy accommodations in a deluxe studio plus a $50 per stay food & beverage credit at Koloa Landing Resort at Poipu. Available on stays through December 20, 2018 for kama&#8216;&#257;ina guests only. Must present valid Hawaii drivers license at check-in. <br/><br/><strong>Call 808-725-2596 to book.</strong>"
  },
  {
    "id": "mini-golf",
    "image": "2018/pop-up-mini-golf.jpg",
    "offerDetails": "The last Sunday of every month is kama`&#257;ina Sunday at Mini Golf and Gardens at Anaina Hou Community Park.  Show your Hawaii State ID and enjoy free miniature golf admissions for you and your `ohana.  While on our campus, enjoy breakfast, lunch or dinner, sweet treats, coffee time on our Playground and Skate Ramps, hike the Wai Koa Loop Trail and more! <a href='http://anainahou.org/'>http://anainahou.org/</a>"
  },
  {
    "id": "naaina",
    "image": "2018/pop-up-naaina.jpg",
    "offerDetails": "Na 'Aina Kai offers kama'&#257;ina 25% off regular tour prices.  Reservations are required and tours are subject to availability. Present your Hawaii State ID or Hawaii Driver's license at check-in. <br /><br /><strong>Please call us at 808-828-0525 to make your reservation.</strong>"
  },
  {
    "id": "piliau",
    "image": "2018/pop-up-piliau.jpg",
    "offerDetails": "Stroll through Waipa's gardens, learning about Hawaiian culture and foods grown in Hawai&#8216;i today. Enjoy a cooking demonstration and generous tasting of some of our favorite farm to table dishes. Afterward, find featured ingredients and meet farmers at our market. Every Tuesday 11am-2pm, reservations required. <br/><br/><strong>For more information about this tour and our non-profit organization, visit <a href='http://www.WaipaFoundation.org'>www.WaipaFoundation.org.</a></strong>"
  },
  {
    "id": "puakea",
    "image": "2018/pop-up-puakea.jpg",
    "offerDetails": "Puakea Golf Course invites our kama'&#257;ina guests to join our annual H&#257;'upu Club for discounts on golf, range balls and guest passes! H&#257;'upu Club members receive an additional $10 off morning golf (regularly $55) and twilight (regularly $45), with additional offers and events throughout the year. A $125 Annual membership charge applies for 2018. Must present valid Hawaii State Driver's License.<br /><br /><strong>For more information call 808-245-8756 or visit us at Puakea located at 4150 Nuhou St in Līhu&#8216;e.</strong>"
  },
  {
    "id": "roberts-hawaii",
    "image": "2018/pop-up-roberts-hawaii.jpg",
    "offerDetails": "Explore Hawai&#8216;i with our friendly and knowledgeable guides . Island tours are available at our special kama&#8216;&#257;ina rates. Save up to 20% with valid Hawaii ID. <br /><br /><strong>To book, call (808) 539-9400.</strong>"
  },
  {
    "id": "safari-heli",
    "image": "2018/pop-up-safari-heli.jpg",
    "offerDetails": "Receive $50 off per person for our Deluxe Safari; regular rate is $239.00 per person. Experience the view from above in the comfort of a state-of-the-art ASTAR 350B2-7 with Mega windows and skylights. Our experienced and knowledgeable pilots will highlight spots that make this the 'oldest island in the Hawaiian chain' a favorite of residents and visitors alike. <br/><br/><strong>Visit our website for more information. <a href='http://www.safarihelicopters.com'>www.safarihelicopters.com</a></strong>"
  },
  {
    "id": "sheraton-kauai-resort",
    "image": "2018/pop-up-sheraton-kauai-resort.jpg",
    "offerDetails": "Experience oceanfront relaxation just steps from the beach at Sheraton Kauai Resort. Kama&#8216;&#257;ina receive special rates starting at $199+ for Garden View accommodations and $269+ for newly refreshed oceanfront accommodations. Book now through December 31, 2018, based on availability. Must present valid Hawaii State ID or Hawaii State Driver's License at check in. <br/><br/> <strong>Call 888-627-8113 and ask for rate plan KAM.</strong> <br/><br/> Rates are not inclusive of tax and daily resort fee."
  },
  {
    "id": "waimea-plantation",
    "image": "2018/pop-up-waimea-plantation.jpg",
    "offerDetails": "Kama&#8216;&#257;ina discover the laid-back serenity of our ocean front plantation-style resort on the sunny western shore of Kaua&#8216;i -- and save up to 15% off our best available rates! Our 60 individual sugar cane plantation era cottages have been thoughtfully restored and range from one to five bedrooms. Each has a complete kitchen, private lanai and exudes the welcoming and authentic charm not found at most Hawai&#8216;i hotels and resorts. Hawaii State ID required, based on availability. Call (808) 338-1625 to book."
  },
  {
    "id": "wailua-bay-view",
    "image": "2018/pop-up-wailua-bay-view.jpg",
    "offerDetails": "Wailua Bay View Oceanfront Condominium is uniquely perched overlooking the beautiful waters of Kaua&#8216;i's famed \"Coconut Coast\".  We invite our kama&#8216;&#257;ina guests to come and experience the view, and enjoy the comfort and relaxation of a fully furnished condo. Book and stay now to December 2018 and save up to 20% off.  <br/><br/><strong><a href='http://www.crhmaui.com'>www.crhmaui.com</a> or call 800-367-5242, Promo Code MS20.</strong>"
  },
  {
    "id": "westin-princeville",
    "image": "2018/pop-up-westin-princeville.jpg",
    "offerDetails": "The Westin Princeville Ocean Resort Villas invites kama'&#257;ina guests to rejuvenate on Kaua&#8216;i's north shore. Book now for travel dates through December 21, 2018 and enjoy rates starting at $247 for an island-view studio villa, equipped with the conveniences of home and Westin signature amenities. Based on availability, black out dates may apply. <br /><br />Must present valid Hawaii State ID or Hawaii State Driver's License at check in. <br /><br /><strong>Call 866-837-4254 and ask for rate plan KAM.</strong>"
  },
  {
    "id": "whalers-cove",
    "image": "2018/pop-up-whalers-cove.jpg",
    "offerDetails": "Whalers Cove Resort invites our kama&#8216;&#257;ina to enjoy a fabulous staycation in Po&#8216;ipū on Kaua&#8216;i! Get 20% off your stay when you show your Hawaii State ID or Hawaii State Driver's license. <br/ ><br /><strong>Call (808) 742-7571 to make your reservation.</strong> <br /><br /> Offer valid for reservations in April, May, June, August and early December only. Not available for reservations in July, October or November. Inventory is limited. May not be combined with other offers."
  }
]